{
    "headache": "For a headache, drink plenty of water, rest in a dark and quiet room, and consider over-the-counter pain relievers like ibuprofen or acetaminophen. If headaches persist, consult a healthcare provider.",
    "stomach ache": "For a stomach ache, avoid solid foods, drink clear fluids, and consider a heating pad for relief. Seek medical attention if the pain is severe or lasts more than 24 hours.",
    "healthy eating": "Healthy eating involves consuming a variety of fruits, vegetables, whole grains, lean proteins, and healthy fats. Minimize sugar, salt, and processed foods.",
    "exercise": "Regular exercise includes 30 minutes of moderate activity, such as walking, cycling, or swimming, at least five times a week. Combine aerobic exercises with strength training for best results.",
    "flu": "For the flu, rest, stay hydrated, and use over-the-counter medications for symptom relief. Consult a doctor if symptoms worsen or persist for more than a week.",
    "sleep hygiene": "To improve sleep hygiene, maintain a consistent sleep schedule, avoid caffeine and electronics before bed, and create a relaxing bedtime routine.",
    "stress management": "Manage stress through relaxation techniques like deep breathing, meditation, or yoga. Regular exercise and maintaining a healthy work-life balance also help.",
    "hydration": "Drink at least 8-10 cups of water daily. Increase intake if you're active, in a hot climate, or feeling dehydrated.",
    "allergies": "For allergies, avoid known triggers, use antihistamines or nasal sprays, and keep windows closed during high pollen seasons. Consult an allergist for persistent symptoms.",
    "mental health": "For mental health, prioritize self-care, seek support from friends or professionals, and consider therapy if needed. Meditation and mindfulness can also help.",
    "back pain": "For back pain, practice good posture, avoid heavy lifting, and do gentle stretching exercises. Use heat or ice packs for temporary relief.",
    "cold": "For a cold, stay hydrated, rest, and use over-the-counter decongestants or cough syrups. If symptoms persist beyond 10 days, see a doctor.",
    "diabetes": "Manage diabetes with a balanced diet, regular exercise, and prescribed medications. Monitor blood sugar levels regularly and consult your doctor for guidance.",
    "heart health": "For heart health, maintain a healthy weight, eat a diet rich in fruits, vegetables, and lean protein, and avoid trans fats. Regular physical activity is essential."
}
